{
  "IndustricaItemPump": "Item pump",
  "Tooltip_IndustricaItemPump": "Utility that can pull items from its input container and push them into its output container.\nConsumes 1 power on pump if an item was able to be pumped, and will not pump if there is not enough power.\nMultiple pumps connected in series multiplies effective throughput.\nWill not pull that which it cannot insert into the output container.",
  "IndustricaPump_PumpingEnabled": "Disable pump",
  "IndustricaPump_PumpingDisabled": "Enable pump",

  "IndustricaElectricOperator": "Electric operator",
  "Tooltip_IndustricaElectricOperator": "Utility that continuously consumes a small amount of power to operate on the information trasmitted through the two input wires with one of a few mathematical and bitwise operations.",
  "IndustricaOperator_CycleOperation": "Cycle operation",

  "IndustricaElectricLever": "Electric output",
  "Tooltip_IndustricaElectricLever": "Utility that continuously consumes a small amount of power to output 1 into the connected wire if it is toggled, or 0 otherwise.\n<b>If the base runs out of power, it will be automatically toggled off, and will require manual intervention to turn back on</b>.",
  "IndustricaLever_Toggle": "Toggle output",

  "IndustricaElectricSplitter": "Electric splitter",
  "Tooltip_IndustricaElectricSplitter": "Utility that continuously consumes a small amount of power to split incoming wire information in two halves.\nIf the input is an odd number, the additional remainder comes through the second output.",

  "IndustricaElectricTimer": "Electric timer",
  "Tooltip_IndustricaElectricTimer": "Utility that continuously consumes a moderate amount of power to delay incoming wire information.\nDelay is determined by the bottom wire input - that is the number of seconds, but <b>the utility has an additional hardcoded delay itself</b>.",

  "IndustricaFilterLocker": "Filtered locker",
  "Tooltip_IndustricaFilterLocker": "Locker with little storage with filtering capability.\nWhen an item is attempted to be inserted, consumes 1 power to determine if it should be allowed.\n<b>The filtration system will not function without enough power</b>.",
  "IndustricaNetworkFilterStorage": "Filter storage",

  "IndustricaItemTechTypeFilterWriter": "Item type filter imprinter",
  "Tooltip_IndustricaItemTechTypeFilterWriter": "Analyses and imprints item type data from the template item (right slot) to the filter (left slot), using a lot of power over a period of time.\nA filter cannot be a template item.\nImprinting process will begin automatically once both slots are filled and destroys the target item.\n<b>If the base runs out of power while it's processing, the target item will be lost</b>.",
  "IndustricaWriterItemTechTypeFilter_Storage": "Imprinter storage",
  "IndustricaWriterItemTechTypeFilter_Access": "Access imprinter",
  "IndustricaWriterItemTechTypeFilter_ErrorDeconstruct": "Cannot deconstruct imprinter with items in it",

  "IndustricaWeighedItemLocker": "Weighed wall locker",
  "Tooltip_IndustricaWeighedItemLocker": "A variant of the wall locker that trades away some of its storage in favour of two item ports and the ability to read out how much of the storage is occupied, through a wire output.\n<b>If the base runs out of power, the wire port will always output 0</b>.",

  "IndustricaBigItemLocker": "Open port locker",
  "Tooltip_IndustricaBigItemLocker": "A variant of the freestanding locker that trades away some of its storage in favour of four item ports.",

  "IndustricaInOutItemPassthrough": "Item pipe wall passthrough",
  "Tooltip_IndustricaInOutItemPassthrough": "Wall utility that allows pipes to pass through to the other side, in both directions.\nDoes not pump by itself - an item pump is still required for logistics, but a secondary pump on the other side is not required.\n<b>Can only be built on the end cap of a corridor - where a corridor and another room may connect</b>.",

  "IndustricaCoreSampleDrill": "Core sample drill",
  "Tooltip_IndustricaCoreSampleDrill": "Drills into the ground and extracts a sample of the local area, containing possible ore traces.\nRequires a bit of time and moderately high power usage, but is cheaper to run than a drill.",
  "Ready_IndustricaCoreSampleDrill": "Core sample ready for pickup",
  "Invalid_IndustricaCoreSampleDrill": "Invalid placement",
  "InvalidSubscript_IndustricaCoreSampleDrill": "Requires terrain",
  "Working_IndustricaCoreSampleDrill": "Drilling",
  "Finished_IndustricaCoreSampleDrill": "Pick up sample",
  "Activate_IndustricaCoreSampleDrill": "Activate",
  "ActivateSubscript_IndustricaCoreSampleDrill": "Not currently drilling",

  "IndustricaDrill": "Drill",
  "Tooltip_IndustricaDrill": "Drills into the ground and extracts rocks that may or may not contain chunks and traces of ores.\nHigh power consumption and time between extractions.",
  "Invalid_IndustricaDrill": "Invalid placement",
  "InvalidSubscript_IndustricaDrill": "Requires terrain",
  "Working_IndustricaDrill": "Drilling",
  "Full_IndustricaDrill": "Inactive",
  "FullSubscript_IndustricaDrill": "Storage is full",

  "IndustricaSmeltery": "Industrial smeltery",
  "Tooltip_IndustricaSmeltery": "Industrial grade machine capable of processing a wide range of materials.\nSupports automatically pumping items in - and out of - it.\nAutomatically moves resources which can be smelted together into its chamber, if it is empty.\n<b>Resources may not be, manually or otherwise, removed from the chamber until smelted.\nProduces slag after every process.\nIf the base runs out of power, the smelter will turn off automatically</b>.",
  "SmeltMeter_IndustricaSmeltery": "Smelted {0}%",
  "InfoHeat_IndustricaSmeltery": "Heat",
  "InfoNoHeat_IndustricaSmeltery": "Off",
  "InfoLowHeat_IndustricaSmeltery": "Low",
  "InfoMediumHeat_IndustricaSmeltery": "Med",
  "InfoHighHeat_IndustricaSmeltery": "High"
}